{"homePage":{"videoSlug":"rOzmNGRi1rg","videoParagraphs":"I became a personal trainer because a great coach helped me overcome difficulties and achieve my goals. Watch this video to see my story and what I can do for you:","paragraphs":"Do you want to be leaner? Fitter? Stronger? I'm here to help you achieve your goals.\r\n\r\nAs your personal trainer, I'll guide you through a series of positive changes and make sure they stay with you for the long-term. When you train with me you'll push boundaries you didn't even know you had.\r\n\r\nWith my structured plans, every session is fun and goal-orientated, leaving you knowing you've worked hard — and smart.\r\n\r\nGet a taster of my training and fitness advice on [my blog](https://medium.com/@rolandjohnson_75946). I offer one-to-one personal training and fitness advice in Liverpool Street, East London and personalised online training and diet packages to clients around the world.\r\n\r\nCheck out what my clients say and get in touch with me for a free consultation to start your journey.","headerImgPath":"blurred-header.jpg","tabTitle":"RJ Transformations","profileImgPath":"about.jpg","title":"How I can help you"},"packagesPage":{"packagesPageSupplementaryContent":"Individual sessions of sixty minutes and thirty minutes are also available.\r\n\r\nIf you have any specific requests or aren't quite sure about what you're about looking for, please get in touch with me and I can tailor a package to meet your needs. Check out my [testimonials](/testimonials) to see what you could achieve!","packages":[{"packageName":"Standard Package","packageDescription":"8 sessions twice a week for the length of a month."},{"packageName":"Premium Package","packageDescription":"12 session three times a week for the length of a month."}],"packagesButtonLabel":"Book your free consultation","packagesPageTitle":"Packages","packagesPageIntroContent":"My packages are designed to deliver results quickly while fitting around your busy life. All packages include nutritional advice and a personalised training program for faster results!"},"videosPage":{"instagramSlugs":["BI-Kz2wD1z0","BISfT2KDjQp","BNM39AsF9HR","BL0yY9BlPv3"],"videosPageIntroContent":"I like to have fun while pushing myself in the gym so here’s a few videos of what I’ve been up to lately!","videosPageTitle":"Videos","youtubeSlugs":[]},"testimonialsPage":{"testimonialsPageIntroContent":"Here are a selection of my clients and the transformations they’ve made. You’ll see that people come to me at different levels of fitness and with different end goals.With my tailored exercise and diet programmes you can make fast and maintable progress towards the body you want.","testimonials":[{"testimonialName":"Louise-Anne","testimonialImgSrc":"louise-anne_small.jpg","testimonialContent":"\"My fitness life began seven months ago and I've been amazed by the changes since then. Signing up for sessions with Roland was literally the best decision I made for myself in 2017.\r\n\r\nHe really knows his stuff and has taught me about lots of positive changes - diet and so on - and how to apply them to my daily life.\r\n\r\nWorking with Roland has improved my confidence and given me a real boost, both inside the gym and outside. I love how the varied workouts keep me on my toes (literally!) and my strength has increased rapidly.\r\n\r\nOur sessions are always interactive and he pushes me to perform at my best. Even when working out alone I've been able to dig into that motivation and drive myself to do my best.\""},{"testimonialName":"Fonz","testimonialImgSrc":"fonz-small.jpg","testimonialContent":"\"After just 11 sessions I saw a massive difference in my body but more importantly my fitness.\r\n\r\nI wanted to up my acceleration and core strength for rugby and Roland tailor-made a plan for me and also devised a food plan.\r\n\r\nHe taught me loads of new exercises I didn't know about as well as ones I could do at home. He's a genuinely fantastic motivator who helped me push myself to the next level.\r\n\r\nSuffice to say I would recommend him to anyone looking for a very personalised and personable PT!\""},{"testimonialName":"Leah","testimonialImgSrc":"leah-small.jpg","testimonialContent":"A massive congratulations to Leah for her 2 year fat loss journey.\r\n\r\nWith hard work we managed to break her plateau of being a \"cardio bunny\" to a weight training and HIIT machine!\r\n\r\nTo anyone that thinks squats, deadlifts and overhead presses will make a woman bulky, I hope these pictures will help bury that myth! - Roland"},{"testimonialName":"Georgia","testimonialImgSrc":"georgia-small.jpg","testimonialContent":"\"Roland is a top quality personal trainer!\r\n\r\nI am into my fourth month of being trained by Roland and I am very happy with the results so far.I would highly recommend Roland if you are serious about transforming your body.\""},{"testimonialName":"Bianca","testimonialImgSrc":null,"testimonialContent":"\"I've been training with Roland for over five months now. I'm the happiest and fittest I've ever been in my entire life! Before I was lazy, overweight and crazy about cardio and counting calories. Going to the gym at the end of a long day at work felt like a massive pain. I never saw any results good enough to make me think I could actually change my jiggly body.\r\n\r\nNow, thanks to Roland, I can't wait to train, I can't wait to push myself and I can't wait to hit new personal tests. I see my little muscles growing session after session and my strength and my mood have never been so good.\r\n\r\nEvery session with him is full of big laughs, fun and PUSH PUSH PUSH! I finally love working out! He's made a big change in my life and is a great personal trainer and friend. Thanks thanks thanks!\""},{"testimonialName":"Simon","testimonialImgSrc":null,"testimonialContent":"\"I started training with Roland in April 2016. I'm in my mid thirties and was far from the best shape of my life.\r\n\r\nSince training with him I have seen significant and consistent improvements in my strength, fitness and physique. I haven't had a single session where I haven't felt like I've worked hard and achieved something. Not only does he keep me motivated and focused but he explains what we're doing and why, so it's easy to see the value in everything.\r\n\r\nThroughout the training I've also gained a far better understanding of my diet and how to adjust it to see the best results. On top of all this he's a really good guy. If you want a fun, professional and hard working PT, and real results, I can't recommend Roland enough.\""},{"testimonialName":"Julie","testimonialImgSrc":null,"testimonialContent":"\"I started training with Roland over 6 months ago. At first I was quite skeptical about having a personal trainer but I have completely changed my mind!\r\n\r\nRoland pushes me in a way that I would never be able to do  myself. I have seen real changes in my body over the past few months, I am fitter and I genuinely feel healthier and happier with my body.\r\n\r\nFinally, Roland has managed to make going to the gym a happy time in my week. It's no longer a chore to work out! Thank you for everything!\""}],"testimonialsPageTitle":"Testimonials"}}